# Tap Homebrew Bundle for managing dependencies
tap "homebrew/bundle"

# Core Development Tools
brew "asdf"            # Version manager for multiple languages
brew "bat"             # Modern `cat` replacement with syntax highlighting
brew "fd"              # Fast alternative to `find`
brew "gh"              # GitHub CLI for repository management
brew "git"             # Version control system
brew "jq"              # JSON processor for scripting
brew "mas"             # Mac App Store CLI
brew "nano"            # Simple text editor
brew "node"            # Node.js for JavaScript development
brew "python@3.13"     # Python 3.13 (specific version)
brew "pipx"            # Python package installer for isolated environments
brew "ripgrep"         # Fast grep alternative
brew "tmux"            # Terminal multiplexer
brew "tree"            # Directory tree visualizer
brew "watchman"        # File watching service for development

# Casks (GUI Applications)
cask "alfred"          # Productivity workflow tool
cask "hazel"           # File organization and automation
cask "iterm2"          # Advanced terminal emulator
cask "karabiner-elements" # Keyboard customizer
cask "miniconda"       # Minimal Conda installer for Python environments
cask "ollama"          # Likely a typo or specific app; assuming a tool like Ollama AI
cask "rectangle-pro"   # Window management tool
cask "visual-studio-code" # Code editor

# VS Code Extensions
vscode "copilot-arena.copilot-arena"      # GitHub Copilot Arena (experimental?)
vscode "dbaeumer.vscode-eslint"           # ESLint integration
vscode "eamodio.gitlens"                  # Git enhancements
vscode "esbenp.prettier-vscode"           # Prettier code formatter
vscode "github.copilot"                   # GitHub Copilot AI assistant
vscode "github.copilot-chat"              # Copilot chat feature
vscode "ms-python.debugpy"                # Python debugger
vscode "ms-python.python"                 # Python extension
vscode "ms-python.vscode-pylance"         # Python language server
vscode "ms-toolsai.jupyter"               # Jupyter notebook support
vscode "ms-toolsai.jupyter-keymap"        # Jupyter keybindings
vscode "ms-toolsai.jupyter-renderers"     # Jupyter renderers
vscode "ms-toolsai.vscode-jupyter-cell-tags" # Jupyter cell tags
vscode "ms-toolsai.vscode-jupyter-slideshow" # Jupyter slideshow support